--[[

简介: ELUNA 单体副本重置卷轴
作者：5L
版本：1.0c
博客：www.5lgames.com
更多脚本请登录博客

]]--

--添加方法 ： { 副本地图ID,副本名字,副本难度,对话选项分类(每个保持不同依次叠加)}
--副本难度分类： 5人YX本 =1	,10人PT =0, 25人PT = 1, 10人YX = 2, 25人YX = 3
local TIMER = 1		   --间隔时间
local ITEM  = 70012    --FB重置卷轴
local FBMAP = {
{249,"奥妮克希亚的巢穴(10)",0,29,},
{249,"奥妮克希亚的巢穴(25)",1,30,},
{269,"开启黑暗之门(10)",0,31,},
{269,"开启黑暗之门(25)",1,32,},
{309,"祖尔格拉布",0,34,},
{409,"熔火之心",0,39,},
{469,"黑翼之巢",0,44,},
{509,"安其拉废墟",0,46,},
{531,"安其拉神殿",0,49,},
{532,"卡拉赞",0,50,},
{533,"纳克萨玛斯(10)",0,51,},
{533,"纳克萨玛斯(25)",1,52,},
{534,"海加尔山之战",0,53,},
{540,"地狱火堡垒：破碎大厅(5H)",1,55,},
{542,"地狱火堡垒：鲜血熔炉(5H)",1,57,},
{543,"地狱火堡垒：城墙(5H)",1,59,},
{544,"玛瑟里顿的巢穴",0,60,},
{545,"盘牙湖泊：蒸汽地窟(5H)",1,62,},
{546,"盘牙湖泊：幽暗沼泽(5H)",1,64,},
{547,"盘牙湖泊：奴隶围栏(5H)",1,66,},
{548,"盘牙湖泊：毒蛇神殿",0,67,},
{550,"风暴要塞",0,68,},
{552,"风暴要塞：禁魔监狱(5H)",1,70,},
{553,"风暴要塞：生态船(5H)",1,72,},
{554,"风暴要塞：能源舰(5H)",1,74,},
{555,"奥金顿：暗影迷宫(5H)",1,76,},
{556,"奥金顿：塞泰克大厅(5H)",1,78,},
{557,"奥金顿：法力墓穴(5H)",1,80,},
{558,"奥金顿：奥金尼地穴(5H)",1,82,},
{564,"黑暗神殿",0,87,},
{565,"格鲁尔的巢穴",0,88,},
{568,"祖阿曼",0,90,},
{574,"乌特加德城堡(5H)",1,95,},
{575,"乌特加德之巅(5H)",1,97,},
{576,"魔枢(5H)",1,99,},
{578,"魔环(5H)",1,101,},
{580,"太阳之井",0,102,},
{585,"魔导师平台(5H)",1,106,},
{595,"净化斯坦索姆(5H)",1,117,},
{599,"岩石大厅(5H)",1,123,},
{600,"达克萨隆要塞(5H)",1,125,},
{601,"艾卓-尼鲁布(5H)",1,127,},
{602,"闪电大厅(5H)",1,129,},
{603,"奥杜尔(10)",0,130,},
{603,"奥杜尔(25)",1,131,},
{604,"古达克(5H)",1,133,},
{608,"紫罗兰监狱(5H)",1,139,},
{615,"黑曜石圣殿(10)",0,145,},
{615,"黑曜石圣殿(25)",1,146,},
{616,"永恒之眼(10)",0,147,},
{616,"永恒之眼(25)",1,148,},
{619,"安卡赫特：古代王国(5H)",1,152,},
{624,"阿尔卡冯的宝库(10)",0,157,},
{624,"阿尔卡冯的宝库(25)",1,158,},
{631,"冰冠堡垒(10)",0,161,},
{631,"冰冠堡垒(25)",1,162,},
{631,"冰冠堡垒(10H)",2,163,},
{631,"冰冠堡垒(25H)",3,164,},
{632,"灵魂洪炉(5H)",1,166,},
{649,"十字军的试炼(10)",0,170,},
{649,"十字军的试炼(25)",1,171,},
{649,"十字军的试炼(10H)",2,172,},
{649,"十字军的试炼(25H)",3,173,},
{650,"冠军的试炼(5H)",1,175,},
{658,"萨隆深渊(5H)",1,177,},
{668,"映像大厅(5H)",1,179,},
{724,"红玉圣殿(10)",0,184,},
{724,"红玉圣殿(25)",1,185,},
{724,"红玉圣殿(10H)",2,186,},
{724,"红玉圣殿(25H)",3,187,},
};

local function RemoveResetMap(event, _, _, player)
	player:RemoveItem(ITEM, 1)
end


local function ResetMap (event, player, item)
	if (player:IsInCombat() == true)then;
		player:SendBroadcastMessage("对不起在战斗状态下无法使用重置卷轴!");
		player:SendAreaTriggerMessage("对不起在战斗状态下无法使用重置卷轴!");
    else
		for k,v in pairs (FBMAP) do
			local gName = v[2]
			local gIntid= v[4]
			player:GossipMenuAddItem(0,"重置"..gName.."。",0,gIntid,false,"确定重置",0)
			player:GossipSendMenu(1, item)
		end
	end
end

local function ResetMap_Select(event, player, item, sender, intid, code)
	for k,v in pairs (FBMAP) do
		local gMap  = v[1]
		local gName = v[2]
		local gDiff = v[3]
		local gIntid= v[4]
		if (intid == gIntid)then
			player:UnbindInstance(gMap,gDiff);
			player:SendAreaTriggerMessage("副本"..gName.."已经重置。");
			player:SendBroadcastMessage("副本"..gName.."已经重置。");
			player:GossipComplete();
			player:RegisterEvent(RemoveResetMap, TIMER, 1, player)
		end
	end	


end

RegisterItemGossipEvent(ITEM, 1, ResetMap)
RegisterItemGossipEvent(ITEM, 2, ResetMap_Select)